#ifndef __BSP_WIRED_H__
#define __BSP_WIRED_H__

#include "gd32e23x.h"

/* ---------------有线功能相关的所有引脚初始化-------------- */
// 初始化有线相关的所有引脚(有效=急停)
void wired_all_gpio_init(void);
/* ---------------急停按钮控制相关的引脚初始化-------------- */
// PB11 电源控制引脚的初始化 高电平有效
void stop_gpio_init(void);
/* ---------------上升反馈电路引脚的初始化-------------- */
// PB3 电机上升引脚的相关初始化操作 低＝有上升信号
void read_up_gpio_init(void);
/* ---------------下降反馈电路引脚的初始化-------------- */
// PB4 电机下降引脚的相关初始化操作 低＝有下降信号
void read_dowm_gpio_init(void);
/* ---------------有线快速按键反馈引脚初始化-------------- */
// PB5 有线快速按键引脚的相关初始化操作 低＝按下；高＝未按下
void read_quicker_gpio_init(void);
/* ---------------下降继电器控制引脚初始化-------------- */
// PA8下降引脚控制初始化 低电平吸合，执行下降
void dowm_gpio_init(void);
/* ---------------上升继电器控制引脚初始化-------------- */
// PA9上升引脚控制初始化 低电平有效
void up_gpio_init(void);
/* ---------------快速控制引脚初始化-------------- */
// PA10快速控制引脚初始化 低电平有效 (有效-吸合 = 快速模式 \ 无效-断开 = 慢速模式)
void quicker_gpio_init(void);



#endif /* __BSP_WIRED_H__ */


